---------------------------------*3.1 distanceR2*-------------------------------

?- distanceR2([2.0,4.0,6.0,8.0],[1.0,3.0,5.0,7.0],Dsq).
Dsq = 4.0.

?- distanceR2([1.0,3.0,5.0,7.0],[3.0,6.0,9.0,12.0],Dsq).
Dsq = 54.0.

?- distanceR2([1.0,2.0,3.0,4.0],[2.0,4.0,6.0,8.0],Dsq).
Dsq = 30.0.

----------------------------*3.2 distanceSqAllMeans*----------------------------


?- distanceSqAllMeans([25.921,15.716],[[32.994,58.539],[69.602,14.568],[75.248,24.346],[45.683,34.467],[30.546,1.634]],Dsq).
Dsq = [1883.836658, 1909.3476650000005, 2507.6298290000004, 742.1366449999999, 219.69334899999998].

?- distanceSqAllMeans([7.356,13.345],[[32.994,58.539],[69.602,14.568],[75.248,24.346],[45.683,34.467],[30.546,1.634]],Dsq).
Dsq = [2699.80468, 3876.0602450000006, 4730.345665000002, 1915.0978129999999, 674.9236209999999].

?- distanceSqAllMeans([10.0,20.0],[[5.0,10.0],[15.0,20.0],[25.0,30.0]],Dsq).
Dsq = [125.0, 25.0, 325.0].

---------------------------------*3.3 listMinPos*-------------------------------

?- listMinPos([49.991,46.35,47.0,35.01,35.01,13.0],M).
M = 5.

?- listMinPos([3,57,94,-1],M).
M = 3.

?- listMinPos([2,7,49,-32,0],M).
M = 3.

-----------------------------------*3.4 elsum*----------------------------------

?- elsum([4.0,8.0,12.0,16.0],[3.0,6.0,9.0,12.0],S).
S = [7.0, 14.0, 21.0, 28.0].

?- elsum([3.0,6.0,9.0,12.0],[5.0,10.0,15.0,20.0],S).
S = [8.0, 16.0, 24.0, 32.0].

?- elsum([5.0,10.0,15.0,20.0],[10.0,20.0,30.0,40.0],S).
S = [15.0, 30.0, 45.0, 60.0].

--------------------------------*3.5 scaleList*---------------------------------

?- scaleList([6.0,12.0,18.0,24.0],4,Answer).
Answer = [1.5, 3.0, 4.5, 6.0].

?- scaleList([8.0,16.0,24.0,32.0],4,Answer).
Answer = [2.0, 4.0, 6.0, 8.0].

?- scaleList([5.0,10.0,15.0,20.0],2,Answer).
Answer = [2.5, 5.0, 7.5, 10.0].

---------------------------------*3.6 zeroes*-----------------------------------

?- zeroes(3,TheList).
TheList = [0.0, 0.0, 0.0].

?- zeroes(7,TheList).
TheList = [0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0].

?- zeroes(1,TheList).
TheList = [0.0].

------------------------------*3.7 zeroMeansSet*--------------------------------

?- zeroMeansSet(2,7,S).
S = [[0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0], [0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0]].

?- zeroMeansSet(6,2,S).
S = [[0.0, 0.0], [0.0, 0.0], [0.0, 0.0], [0.0, 0.0], [0.0, 0.0], [0.0, 0.0]].

?- zeroMeansSet(3,5,S).
S = [[0.0, 0.0, 0.0, 0.0, 0.0], [0.0, 0.0, 0.0, 0.0, 0.0], [0.0, 0.0, 0.0, 0.0, 0.0]].

-------------------------------*3.8 zeroVdiff*----------------------------------

?- zeroVdiff([5,4,3,2,1],[5,4,3,2,1]).
true.

?- zeroVdiff([5,4,3,2,1],[5,4,3,2,0]).
false.

?- zeroVdiff([4,6,3,6],[4,6,3,6]).
true.

------------------------------*3.9 zeroSetDiff*---------------------------------

?- zeroSetDiff([[8,9,10],[13,14,15]],[[8,9,10],[13,14,15]]).
true.

?- zeroSetDiff([[8,9,10],[13,14,15]],[[8,9,0],[13,14,15]]).
false.

?- zeroSetDiff([[2,4,6],[1,2,3]],[[1,2,3],[2,4,6]]).
false.

------------------------------*3.10 zeroCounts*---------------------------------

?- zeroCounts(9,C).
C = [0, 0, 0, 0, 0, 0, 0, 0, 0].

?- zeroCounts(2,C).
C = [0, 0].

?- zeroCounts(7,C).
C = [0, 0, 0, 0, 0, 0, 0].

-----------------------------*3.11 updateCounts*--------------------------------

?- updateCounts(3,[1,3,5,7],D).
D = [1, 3, 5, 8].

?- updateCounts(2,[0,0,0,0,0,0],D).
D = [0, 0, 1, 0, 0, 0].

?- updateCounts(0,[5,4,3,2,1],D).
D = [6, 4, 3, 2, 1].

-----------------------------*4.1 updateMeansSum*-------------------------------

?- updateMeansSum([2.0,3.0,4.0],1,[[8.0,9.0,10.0],[13.0,14.0,15.0]],N).
N = [[8.0, 9.0, 10.0], [15.0, 17.0, 19.0]].

?- updateMeansSum([5.0,7.0,9.0],0,[[8.0,9.0,10.0],[13.0,14.0,15.0]],N).
N = [[13.0, 16.0, 19.0], [13.0, 14.0, 15.0]].

?- updateMeansSum([1.0,3.0,5.0],2,[[1.0,2.0,3.0],[2.0,4.0,6.0],[3.0,6.0,9.0]],N).
N = [[1.0, 2.0, 3.0], [2.0, 4.0, 6.0], [4.0, 9.0, 14.0]].

------------------------------*4.2 formNewMeans*--------------------------------

?- formNewMeans([[55.23,75.0],[92.59]],[5,8],NewMeans).
NewMeans = [[11.046, 15.0], [11.57375]].

?- formNewMeans([[103.49],[23.71]],[5,8],NewMeans).
NewMeans = [[20.698], [2.96375]].

?- formNewMeans([[23.0,45.0],[2.0,16.0]],[2,3],NewMeans).
NewMeans = [[11.5, 22.5], [0.6666666666666666, 5.333333333333333]].

-------------------------------*4.3 reclassify*---------------------------------

?- h(H),reclassify(H,[[-47.354224,-35.34453],[-63.643990,-54.354022]],UpdatedMeans).
H = [[46.356342, 62.448746], [-64.65906, -32.147893], [23.13465, 59.63509], [-45.443999, -50.46789], [54.426897, 42.356], [-76.765456, -54.986321], [29.325456, 58.986799], [-40.659533|...], [...|...]|...],
UpdatedMeans = [[20.77460346853148, 23.79447071678322], [-52.374074350877166, -59.867273157894736]].

?- h(H),reclassify(H,[[20.774603,23.794470],[-52.374074,-59.867273]],UpdatedMeans).
H = [[46.356342, 62.448746], [-64.65906, -32.147893], [23.13465, 59.63509], [-45.443999, -50.46789], [54.426897, 42.356], [-76.765456, -54.986321], [29.325456, 58.986799], [-40.659533|...], [...|...]|...],
UpdatedMeans = [[50.39145249999999, 51.911898], [-50.53699191999999, -52.01015057499999]].

?- h(H),reclassify(H,[[50.391452,51.911898],[-50.536991,-52.010150]],UpdatedMeans).
H = [[46.356342, 62.448746], [-64.65906, -32.147893], [23.13465, 59.63509], [-45.443999, -50.46789], [54.426897, 42.356], [-76.765456, -54.986321], [29.325456, 58.986799], [-40.659533|...], [...|...]|...],
UpdatedMeans = [[50.39145249999999, 51.911898], [-50.53699191999999, -52.01015057499999]].
   
-----------------------------------*4.4 cmeans*---------------------------------


?- h(H),cmeans(H,[[-57.243999,-35.358922],[-68.245233,-55.358299]],MuFinal).
H = [[46.356342, 62.448746], [-64.65906, -32.147893], [23.13465, 59.63509], [-45.443999, -50.46789], [54.426897, 42.356], [-76.765456, -54.986321], [29.325456, 58.986799], [-40.659533|...], [...|...]|...],
MuFinal = [[50.39145249999999, 51.911898], [-50.53699191999999, -52.01015057499999]].

?- h(H),cmeans(H,[[-52.346099,-59.009424],[-51.100353,-45.259200]],MuFinal).
H = [[46.356342, 62.448746], [-64.65906, -32.147893], [23.13465, 59.63509], [-45.443999, -50.46789], [54.426897, 42.356], [-76.765456, -54.986321], [29.325456, 58.986799], [-40.659533|...], [...|...]|...],
MuFinal = [[-50.53699191999999, -52.01015057499999], [50.39145249999999, 51.911898]].

?- h(H),cmeans(H,[[-47.993432,-54.463254],[-34.536886,-56.346754]],MuFinal).
H = [[46.356342, 62.448746], [-64.65906, -32.147893], [23.13465, 59.63509], [-45.443999, -50.46789], [54.426897, 42.356], [-76.765456, -54.986321], [29.325456, 58.986799], [-40.659533|...], [...|...]|...],
MuFinal = [[-50.53699191999999, -52.01015057499999], [50.39145249999999, 51.911898]].


--------------------------------------------------------------------------------
